
const blocks = document.querySelectorAll('.block');
const parText = document.querySelector('.par');
const predictions = {
    capricorn: ['♑ Козеріжка - рішення ви приймаєте довго, а от про них шкодуєте швидко',
        '♑ Козеріжка - ви вмієте бути терплячим, але тільки до третьої спроби',
        '♑ Козеріжка - ваш ідеальний маршрут: дім - кава - дім, без зайвих зупинок',
        '♑ Козеріжка - життя - це експеримент і ви його точно не хочете повторювати',
        '♑ Козеріжка - ви любите розкіш, але й безкоштовна похвала підійде'],
    aquarius: ['♒ Водолій - ваші рішення залежать від настрою, а настрій - від рандомних речей',
        '♒ Водолій - якщо ви мовчите, це ще не значить, що все добре, а просто що вам лінь пояснювати',
        '♒ Водолій - ваш секрет продуктивності: не треба вас чіпати і буде результат',
        '♒ Водолій - ви не відкладаєте рішення, ви просто вивчаєте всі можливі наслідки',
        '♒ Водолій - щастя - це не тоді, коли вас розуміють, а коли вас не чіпають'],
    pisces: ['♓ Риби - найкраще за все працюється не на роботі, і не вдома. взагалі хз де',
        '♓ Риби - ви не відкладаєте гроші, ви просто навіть не знаєте, де вони',
        '♓ Риби - мінімалізм - це коли у стосунках є все, окрім особистого простору',
        '♓ Риби - ви не спізнюєтесь, ви драматично з*являєтесь',
        '♓ Риби - ваше життя - це постійна черга оновлень, але ви завжди натискаєте «нагадати пізніше»'],
    aries: ['♈ Овен - доросле життя - це коли замість пригод обираєш новий матрац',
        '♈ Овен - кожен ваш понеділок — це окремий вид випробування на терпіння',
        '♈ Овен - працювати і дружити треба з різними людьми',
        '♈ Овен - почати день легко, але його треба ще й закінчити...',
        '♈ Овен - якщо ніхто не помічає, що ви постійно в шоці, то значить у вас хороший косметолог'],
    taurus: ['♉ Телець - для вас спонтанність - це запланувати щось за день до',
        '♉ Телець - ви вперті, але це не проблема, якщо з вами не сперечатися',
        '♉ Телець - якщо вам все не подобається, то це не дивно',
        '♉ Телець - бути собою легко, якщо ніхто не ставить зайвих запитань',
        '♉ Телець - хочеться все і одразу, але оце «все» завжди в дефіциті'],
    gemini: ['♊ Близнюки - добрий ранок всім, окрім тих, хто каже, що вам робити',
        '♊ Близнюки - ви намагаєтеся не переживати, але життя дає вам приводи',
        '♊ Близнюки - у вас гарний характер, але це секретна інформація',
        '♊ Близнюки - ваш стиль життя – це пасивна агресія у відповідь на активні пропозиції',
        '♊ Близнюки - ви не пливете за течією, просто вже немає сил вигрібати'],
    cancer: ['♋ Рак - ви не інтроверт, але спілкуватися навіть на вихідних - це занадто',
        '♋ Рак - робота роботою, але якби платили за страждання, ви були б мільйонером',
        '♋ Рак - іноді здається, що все під контролем. але це відчуття швидко зникає',
        '♋ Рак - робити вигляд, що все нормально - це ваша фізична активність',
        '♋ Рак - ви не інтроверт, просто вам не подобається 90% людей'],
    leo: ['♌ Лев - ви не токсичні, просто реалістичні до неможливості',
        '♌ Лев - головне не те, що ви зайняті, а щоб всі про це знали',
        '♌ Лев - якщо сьогодні робочий день, то це не означає, що ви будете працювати',
        '♌ Лев - лежать весь день - це теж баланс, але горизонтальний',
        '♌ Лев - якщо ви щось вирішили, то змінити вашу думку може тільки вигоряння'],
    virgo: ['♍ Діва - чим гірше особисте життя, тим краще знання психології',
        '♍ Діва - понеділок - це старт, який ви почнете десь у середу, якщо настрій буде',
        '♍ Діва - хочеться закохатися, але без втрати особистого простору і здорового глузду',
        '♍ Діва - ви не любите, коли в приміщенні більше двох людей, дякую за розуміння',
        '♍ Діва - ви б встигали більше, якби день тривав хоча б 48 годин'],
    libra: ['♎ Терези - відпочинок - це теж задача, яку ви постійно відкладаєте',
        '♎ Терези - ваш соціальний етикет — це відповідати через три дні, щоб не здаватися нав’язливими',
        '♎ Терези - вам не потрібен будильник, якщо є тривожність',
        '♎ Терези - продуктивність – це міф, створений людьми, які вміють рано вставати',
        '♎ Терези - ваш головний ресурс – це нерви, і їх потрібно економити'],
    scorpio: ['♏ Скорпіон - робочий день триває 8 годин, а відчувається як три життя',
        '♏ Скорпіон - ваше терпіння безмежне, якщо не виходити за його межі',
        '♏ Скорпіон - якщо колишні стали кращим після вас – значить, ви були апгрейдом, а не помилкою',
        '♏ Скорпіон - енергія закінчилася, будь ласка, зверніться пізніше',
        '♏ Скорпіон - жити весело, якщо не замислюватися, як саме'],
    sagittarius: ['♐ Стрілець - вихідні пролітають швидше, ніж реклама, яку можна пропустити',
        '♐ Стрілець - не треба вас нікуди звати, ви не збираєтеся виходити із зони комфорту, дякую',
        '♐ Стрілець - ваша нервова система - це співробітник місяця',
        '♐ Стрілець - ви не песиміст, ви просто реаліст з досвідом',
        '♐ Стрілець - плани на день: використовувати всі захисні механізми по черзі']
};


let typingSpeed = 75;
let isTyping = false; 

blocks.forEach(block => {
    const btn = block.querySelector('button');
    const par = block.querySelector('.par');
    const sign = btn.dataset.sign;

    let remainingQuotes = [...predictions[sign]];

    btn.addEventListener('click', () => {
        if (isTyping) return;

        document.querySelectorAll('.par').forEach(p => {
      p.classList.remove('active');
      p.textContent = ""; 
    });

    
    par.classList.add('active');

        if (remainingQuotes.length === 0) {
            remainingQuotes = [...predictions[sign]];
        }

        const randomIndex = Math.floor(Math.random() * remainingQuotes.length);
        const quote = remainingQuotes[randomIndex];
        remainingQuotes.splice(randomIndex, 1);
    
    
        isTyping = true;
        typeQuote(quote, 0, par);
    })

});

function typeQuote(text, i, element) {
  if (i < text.length) {
    element.textContent += text.charAt(i);
    setTimeout(() => typeQuote(text, i + 1, element), typingSpeed);
  } else {
    isTyping = false;
  }
}

